講義資料はgoogleドライブに保存してる

In [181]:
import pandas as pd

# pandasの基本

In [182]:
#data frame読み込み
df = pd.read_csv("data/titanic_train.csv", engine='python')

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
df.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
636,637,0,3,"Leinonen, Mr. Antti Gustaf",male,32.0,0,0,STON/O 2. 3101292,7.9250,NaN,S
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S

In [13]:
#データの形
df.shape

(891, 12)

In [14]:
#データの情報 型とか容量とか
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
#データが欠損している所をtrueで表示
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [17]:
#欠損しているところの合計を表示
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**データ分析は基本的にデータがきれいじゃない。最初に欠損をチェックするが大事**

# データの抽出

エクセルでいうところのフィルターを作る作業

In [19]:
#locを使う。
# : コロンは全てという意味になる。
df.loc[:,:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
df.loc[[2, 4, 6, 8], ['PassengerId', 'Survived', 'Name']]

   PassengerId  Survived                                               Name
2            3         1                             Heikkinen, Miss. Laina
4            5         0                           Allen, Mr. William Henry
6            7         0                            McCarthy, Mr. Timothy J
8            9         1  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)

In [23]:
import numpy as np

In [25]:
np.arange(2,10,2)

array([2, 4, 6, 8])

In [27]:
df.loc[np.arange(2,10,2),:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [28]:
df[['Sex']]

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [31]:
#なにがるの？
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [33]:
#だんせいかどうか
df['Sex'] == 'male'

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [34]:
#男性の列だけ
df.loc[df['Sex'] == 'male', :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
#女性の列だけ(否定の条件
df.loc[df['Sex'] != 'male', :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [41]:
#女性の列だけ(否定の条件
df.loc[~(df['Sex'] == 'male'), :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [42]:
# 複数条件を同時に指定するとき
# 性別＝女性　”かつ”　Ageが10以下
df.loc[(df['Sex'] == 'female')&(df['Age']<=10), :].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.0,1,2,SC/Paris 2123,41.5792,NaN,C
58,59,1,2,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.2750,NaN,S

In [43]:
# 複数条件を同時に指定するとき
# 性別＝女性　”または”　Ageが10以下
df.loc[(df['Sex'] == 'female') | (df['Age']<=10), :].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

# 統計的なところ

## 集計

In [44]:
# 1つの列を選んで平均や合計のみ見るとき
df['Age'].mean()

29.69911764705882

In [45]:
# 中央値
df['Age'].median()

28.0

In [46]:
# 1つの列を選んで平均や合計のみ見るとき
df['Fare'].sum()

28693.9493

In [47]:
# quantileで分位点の確認
df['Age'].quantile(0.25)

20.125

In [48]:
# 値の数を数える
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [49]:
# カテゴリ変数の内容確認　ユニーク数
df['Pclass'].nunique()

3

In [50]:
# カテゴリ変数の内容確認　ユニーク
df['Pclass'].unique()

array([3, 1, 2])

In [51]:
# .locと合わせて
df.loc[df['Survived']==1, 'Age'].mean()

28.343689655172415

## group by 使える

In [53]:
# group by
df.groupby('Sex').sum()

/tmp/ipykernel_348/2164305093.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Sex').sum()

        PassengerId  Survived  Pclass       Age  SibSp  Parch        Fare
Sex
female       135343       233     678   7286.00    218    204  13966.6628
male         262043       109    1379  13919.17    248    136  14727.2865

In [54]:
# group by
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [55]:
df.groupby('Sex')['Age'].mean().reset_index()

      Sex        Age
0  female  27.915709
1    male  30.726645

In [56]:
# クロス集計表の作成 ピポットテーブル
df.pivot_table(index='Sex', columns='Survived', values='PassengerId', aggfunc='count')

Survived    0    1
Sex
female     81  233
male      468  109

## データ加工

pythonは軽視されがちがけど、型は重要

In [57]:
# 列の型変更　（int型をobject型へ変える） 元のデータが書き換わるわけではない
df['PassengerId'].astype(str)

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: object

In [61]:
# 新たな列を追加
df['StrPassengerId'] = df['PassengerId'].astype(str)
df['StrPassengerId']

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: StrPassengerId, Length: 891, dtype: object

In [62]:
# データの並べ替え
df.sort_values('Fare', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,259
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,738
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,680
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,89
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,28
...,...,...,...,...,...,...,...,...,...,...,...,...,...
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S,634
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S,414
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S,823
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S,733
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S,675

In [63]:
# 指定した列（Series）をリストに変換
name_list = df['Name'].tolist()

# リストの10番まで表示
name_list[:10]

['Braund, Mr. Owen Harris',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Heikkinen, Miss. Laina',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Allen, Mr. William Henry',
 'Moran, Mr. James',
 'McCarthy, Mr. Timothy J',
 'Palsson, Master. Gosta Leonard',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Nasser, Mrs. Nicholas (Adele Achem)']

In [64]:
# リストの順番を並び替え
sorted_name_list = sorted(name_list)

# 並び替えたリストの10番まで表示
sorted_name_list[:10]

['Abbing, Mr. Anthony',
 'Abbott, Mr. Rossmore Edward',
 'Abbott, Mrs. Stanton (Rosa Hunt)',
 'Abelson, Mr. Samuel',
 'Abelson, Mrs. Samuel (Hannah Wizosky)',
 'Adahl, Mr. Mauritz Nils Martin',
 'Adams, Mr. John',
 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Aks, Mrs. Sam (Leah Rosen)',
 'Albimona, Mr. Nassef Cassem']

In [66]:
# 日付のサンプルデータ作成 DatetimeIndex っていう型でできる
dateidx = pd.date_range(start='2021-02-03', periods=10, freq='D')
dateidx

DatetimeIndex(['2021-02-03', '2021-02-04', '2021-02-05', '2021-02-06',
               '2021-02-07', '2021-02-08', '2021-02-09', '2021-02-10',
               '2021-02-11', '2021-02-12'],
              dtype='datetime64[ns]', freq='D')

In [67]:
date_series = pd.Series(dateidx)
date_series

0   2021-02-03
1   2021-02-04
2   2021-02-05
3   2021-02-06
4   2021-02-07
5   2021-02-08
6   2021-02-09
7   2021-02-10
8   2021-02-11
9   2021-02-12
dtype: datetime64[ns]

In [69]:
# .dt.ホゲホゲ　でdatetime64[ns]型の日付データから年、月、日、曜日、第何週など情報が取れる
date_series.dt.month

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
9    2
dtype: int64

In [70]:
date_series.dt.weekday

0    2
1    3
2    4
3    5
4    6
5    0
6    1
7    2
8    3
9    4
dtype: int64

In [71]:
date_series.dt.day_name()

0    Wednesday
1     Thursday
2       Friday
3     Saturday
4       Sunday
5       Monday
6      Tuesday
7    Wednesday
8     Thursday
9       Friday
dtype: object

### 練習

In [73]:
# 文字列をdatetime型にする時は pd.to_datetime()を使う
# サンプルデータ作成
datedf_example = pd.DataFrame(
    [['2020-02-01', 180]
     , ['2020-02-02', 192]
     , ['2020-02-03', 186]
     , ['2020-02-04', 173]
     , ['2020-02-05', 119]
     , ['2020-02-06', 168]
     , ['2020-02-07', 157]
     , ['2020-02-08', 204]
     , ['2020-02-09', 181]
     , ['2020-02-10', 188]])
datedf_example.columns=['date_str', 'value']
datedf_example

     date_str  value
0  2020-02-01    180
1  2020-02-02    192
2  2020-02-03    186
3  2020-02-04    173
4  2020-02-05    119
5  2020-02-06    168
6  2020-02-07    157
7  2020-02-08    204
8  2020-02-09    181
9  2020-02-10    188

In [74]:
#日付を文字列型からdatetime型に変換する
datedf_example['date_datetime'] = pd.to_datetime(datedf_example['date_str'], format='%Y-%m-%d')
datedf_example

     date_str  value date_datetime
0  2020-02-01    180    2020-02-01
1  2020-02-02    192    2020-02-02
2  2020-02-03    186    2020-02-03
3  2020-02-04    173    2020-02-04
4  2020-02-05    119    2020-02-05
5  2020-02-06    168    2020-02-06
6  2020-02-07    157    2020-02-07
7  2020-02-08    204    2020-02-08
8  2020-02-09    181    2020-02-09
9  2020-02-10    188    2020-02-10

In [77]:
#曜日や週番号などが簡単に取得できるようになる。
datedf_example['date_datetime'].dt.day_name()

0     Saturday
1       Sunday
2       Monday
3      Tuesday
4    Wednesday
5     Thursday
6       Friday
7     Saturday
8       Sunday
9       Monday
Name: date_datetime, dtype: object

### 列を追加していく

In [78]:
df['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [81]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [82]:
# .locを使って乗船した港を数値化した列を作成
# やや冗長な書き方ですが、0の列を作っておいて条件に当てはまる列にだけ1を代入していく方法です

df['Embarked_is_C'] = 0
df['Embarked_is_S'] = 0
df['Embarked_is_Q'] = 0

df.loc[df['Embarked']=='C', 'Embarked_is_C'] = 1
df.loc[df['Embarked']=='S', 'Embarked_is_S'] = 1
df.loc[df['Embarked']=='Q', 'Embarked_is_Q'] = 1

In [83]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId,Embarked_is_C,Embarked_is_S,Embarked_is_Q
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,0,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0,1,0

### 列の追加2
assign と lambda を使っても新たな列を作成できます
lambdaは無名関数と言ってassignや後述のmap、applyといっしょに一時的な処理を書くときに使います

In [85]:
# 例えば、底辺と高さを受け取って三角形の面積を返すような関数を書くと、↓のようになります
def get_S_triangle(a, h):
  S = a * h / 2
  return S


# これをlambda　式の書き方にすると

S_triangle = lambda a, h: a * h / 2

# lambda式自体が関数オブジェクトになります

In [86]:
#結果
get_S_triangle(4,6)

12.0

In [87]:
#結果
S_triangle(4,6)

12.0

lambdaはその場限りで使うようなときに使う！

In [88]:
# assign と lambda を使っても新たな列を作成できます


# 家族の人数を計算した列を作成
# 一時的なデータフレームができるだけなので、元データフレームを書き換える時は代入必要
df = df.assign(family_size=lambda x: x['SibSp'] + x['Parch'])
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId,Embarked_is_C,Embarked_is_S,Embarked_is_Q,family_size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1,0,0,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,0,1,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,1,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,887,0,1,0,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,888,0,1,0,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,889,0,1,0,3
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,890,1,0,0,0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,891,0,0,1,0

## データの結合していく

In [90]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [91]:
# 港の名前を示したデータフレームを作成
df_port_name = pd.DataFrame([['C', 'Cherbourg'], ['Q', 'Queenstown'], ['S', 'Southampton']])
df_port_name.columns=['Embarked', 'Embarked_all_words']
df_port_name

  Embarked Embarked_all_words
0        C          Cherbourg
1        Q         Queenstown
2        S        Southampton

In [92]:
# merge 元のデータフレームに、港の名前を示したデータフレームをマージする
df.merge(df_port_name, how='left', on='Embarked')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId,Embarked_is_C,Embarked_is_S,Embarked_is_Q,family_size,Embarked_all_words
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,1,0,1,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1,0,0,1,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,0,1,0,0,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,1,0,1,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0,1,0,0,Southampton
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,887,0,1,0,0,Southampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,888,0,1,0,0,Southampton
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,889,0,1,0,3,Southampton
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,890,1,0,0,0,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,891,0,0,1,0,Queenstown

港の名前がくっついた

In [93]:
# mergeの他にconcatと言う関数もありますが、用途が少し違います
# concatは、（例えばループ処理でデータフレームをたくさん作ったとき）　同じ形のデータフレームを合体させるときに使う
# (mergeはテーブルのjoinでよく使う)

df_a = pd.DataFrame([['a11', 'a12', 'a13'], ['a21', 'a22', 'a23']])
print('df_a')
display(df_a)

df_b =pd.DataFrame([['b11', 'b12'], ['b21', 'b22'], ['b31', 'b32']])
print('\ndf_b')
display(df_b)

df_c =pd.DataFrame([['c11', 'c12', 'c13'], ['c21', 'c22', 'c23'], ['c31', 'c32', 'c33']])
print('\ndf_c')
display(df_c)

df_a

     0    1    2
0  a11  a12  a13
1  a21  a22  a23

df_b

     0    1
0  b11  b12
1  b21  b22
2  b31  b32

df_c

     0    1    2
0  c11  c12  c13
1  c21  c22  c23
2  c31  c32  c33

In [95]:
# 結合したいデータフレームをリストに入れる　　縦に結合される
# ※同じ列名であれば、きれいに各列名の下に結合される 同じじゃないと、横にひっつくよ。 なにもないところはNULLになる。
pd.concat([df_a, df_c])

     0    1    2
0  a11  a12  a13
1  a21  a22  a23
0  c11  c12  c13
1  c21  c22  c23
2  c31  c32  c33

### aplay, map

#### map関数

pd.Seriesの全要素に関数を一発で適用させるmethod

applyはpd.DataFrameに使用、mapはpd.Seriesに使用

In [96]:
# mapするための関数作成
def gender_lab(gender:str)->int:
  if gender == 'male':
    res = 1
  elif gender == 'female':
    res = 0
  else :
    res = 2
  return res

In [97]:
gender_lab('male')

1

In [98]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [99]:
df['Sex'].map(gender_lab)

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

#### apply関数
関数を全ての行または列に適用する関数

In [100]:
df[['SibSp', 'Parch']]

     SibSp  Parch
0        1      0
1        1      0
2        0      0
3        1      0
4        0      0
..     ...    ...
886      0      0
887      0      0
888      1      2
889      0      0
890      0      0

[891 rows x 2 columns]

In [101]:
df[['SibSp', 'Parch']].apply(sum, axis=0)

SibSp    466
Parch    340
dtype: int64

In [102]:
df[['SibSp', 'Parch']].apply(sum, axis=1)

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Length: 891, dtype: int64

# 練習問題

## 1.性別を数値に変換した列を作ってください

In [105]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId,Embarked_is_C,Embarked_is_S,Embarked_is_Q,family_size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1,0,0,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,0,1,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,1,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0,1,0,0

In [106]:
df['fm']=0
df.loc[df['Sex']=='female','fm']=1

In [107]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,StrPassengerId,Embarked_is_C,Embarked_is_S,Embarked_is_Q,family_size,fm
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0,1,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,1,0,0,1,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3,0,1,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,1,0,1,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5,0,1,0,0,0

## 2. 年齢の欠損値を平均値で補完した新たな列"Age_filled"を作ってください

In [187]:
df["Age"].mean()

29.69911764705882

In [188]:
df["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [189]:
df["Age_filled"] = df["Age"].copy()

In [190]:
df["Age_filled"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age_filled, Length: 891, dtype: float64

In [191]:
df.loc[df["Age_filled"].isnull(),"Age_filled"] = df["Age"].mean()

In [192]:
df["Age_filled"].isnull().sum()

0

## 3. 2で作ったAge_filledを四分位で分けたグループを作り、Survivedとのクロス集計表を作ってください

In [193]:
df.groupby("Survived")["Age_filled"].quantile(0.25)

Survived
0    23.0
1    21.0
Name: Age_filled, dtype: float64

In [194]:
df["Age_filled"].quantile(0.25)]

SyntaxError: unmatched ']' (3418690824.py, line 1)

In [195]:
df["Age_filled"].quantile(0.5)

29.69911764705882

In [196]:
df["Age_filled"].quantile(0.75)

35.0

In [197]:
df.loc[df["Age_filled"]<= df["Age_filled"].quantile(0.25),["Name"]]

                                    Name
0                Braund, Mr. Owen Harris
7         Palsson, Master. Gosta Leonard
9    Nasser, Mrs. Nicholas (Adele Achem)
10       Sandstrom, Miss. Marguerite Rut
12        Saundercock, Mr. William Henry
..                                   ...
875     Najib, Miss. Adele Kiamie "Jane"
876        Gustafsson, Mr. Alfred Ossian
877                 Petroff, Mr. Nedelio
882         Dahlberg, Miss. Gerda Ulrika
887         Graham, Miss. Margaret Edith

[231 rows x 1 columns]

In [198]:
groupA = df.loc[df["Age_filled"] <= df["Age_filled"].quantile(0.25),["Name"]]

In [199]:
groupB = df.loc[((df["Age_filled"].quantile(0.25) < df["Age_filled"]) & (df["Age_filled"] <= df["Age_filled"].quantile(0.5))),["Name"]]

In [200]:
groupC = df.loc[((df["Age_filled"].quantile(0.5) < df["Age_filled"]) & (df["Age_filled"] <= df["Age_filled"].quantile(0.75))),["Name"]]

In [201]:
groupD = df.loc[df["Age_filled"].quantile(0.75) < df["Age_filled"] ,["Name"]]

In [202]:
df["Age_quantile"] = 0

In [203]:
df.loc[df["Age_filled"] <= df["Age_filled"].quantile(0.25),["Age_quantile"]] = 0

In [204]:
df.loc[((df["Age_filled"].quantile(0.25) < df["Age_filled"]) & (df["Age_filled"] <= df["Age_filled"].quantile(0.5))),["Age_quantile"]] = 1

In [205]:
df.loc[((df["Age_filled"].quantile(0.5) < df["Age_filled"]) & (df["Age_filled"] <= df["Age_filled"].quantile(0.75))),["Age_quantile"]] = 2

In [206]:
df.loc[df["Age_filled"].quantile(0.75),["Age_quantile"]] = 3

In [207]:
df["Age_quantile"]

0      0
1      0
2      1
3      2
4      2
      ..
886    1
887    0
888    1
889    1
890    2
Name: Age_quantile, Length: 891, dtype: int64

In [209]:
df.pivot_table(index='Survived', columns="Age_quantile", values='PassengerId', aggfunc='count')

Age_quantile      0      1     2    3
Survived
0             266.0  220.0  62.0  1.0
1             181.0  110.0  51.0  NaN